{
    "TITLE": "Software Engineer | Web Developer",
    "TYPEWRITER": [
    "Hi, my name is Jonathan",
    "I'm a Web Developer",
    "I'm an Engineer",
    "I'm a Software Engineer",
    "Here is my interactive resume"],
    "SECTIONS": {
        "ABOUT": "About Me",
        "EDUCATION": "Education",
        "WORK": "Experience",
        "SKILLS": "Skills",
        "VOLUNTEERING": "Volunteering"
    },
    "VIEW_MORE": "View More",
    "VIEW_LESS": "View Less",
    "EDUCATION": {
        "CONCORDIA": {
            "SCHOOL": "Concordia University (2012-2017)",
            "DESC": "Co-op Bachelor of Software Engineering. Graduated with distinction. Cumulative GPA 3.78.",
            "HONOR": "Honors",
            "HONORS": "<ul class='list compact'><li>Stan Heaps Scholarship - 2017</li><li>Dean's List - 2017</li><li>Dean's List - 2016</li><li>Golden Key Honor Society - 2015</li></ul>"
        },
        "CEM": {
            "SCHOOL": "Collège Édouard-Montpetit (2010-2012)",
            "DESC": "DEC in Pure & Applied Sciences."
        }
    },
    "SKILLS": {
        "SOFT": "Soft Skills",
        "HARD": "Hard Skills",
        "LEADERSHIP": "Leadership",
        "WORK ETHIC": "Work Ethic",
        "POSITIVE ATTITUDE": "Positive Attitude",
        "COMMUNICATION": "Communication",
        "TIME MANAGEMENT": "Time Management",
        "PROBLEM-SOLVING SKILLS": "Problem Solving Skills",
        "TEAM PLAYER": "Team Player",
        "CONFIDENCE": "Confidence",
        "LEARN FROM CRITICISM": "Learn from Criticism",
        "WORK UNDER PRESSURE": "Work under pressure",
        "ADAPTABILITY": "Adaptability"
    },
    "VOLUNTEERING": {
        "DIABLOS": {
            "HEADER": "Quarterback Football Coach (2015 & 2018)",
            "DESC": "Quarterback coach in my hometown football team for the Diablos La Prairie Bantam AAA team. My goals are to make sure that the children are able to reconcile competitive sports and school. A football player has to be dedicated, respectful, organized, perseverent, and much more. That is, our role as football coach, is to lead children to achieve these goals on a football field, and in their personal life. Also, it is to provide a secure environment for football players to enjoy their favorite sport without serious injuries."
        },
        "HABITAT": {
            "HEADER": "Habitat For Humanity (2017)",
            "DESC": "Founded in 1985, Habitat for Humanity Canada is a national, nonprofit organization working toward a world where everyone has a decent and affordable place to call home."
        },
        "MISSION": {
            "HEADER": "Welcome Hall Mission (2017)",
            "DESC":"Established in 1892, Welcome Hall Mission has become the largest doorway to help for Montrealers in need. Many programs are available to support the homeless, young single mothers, families and at-risk youth. Providing hope through concrete actions and effective solutions."
        }
    },
    "WORK": [
        {
            "COMPANY": "Vigilant, A DRW Company",
            "POSITION": "Software Engineer",
            "DATE": "May 2017 - Current",
            "DESCRIPTION": "Web development is my thing. I appreciate taking ideas from end-users and building a customized system that will respond and exceed requirements in a timely and stylish manner. Ansible, React, Python, Angular, Nodejs are my most used languages and tools."
        },
        {
            "COMPANY": "Vigilant, A DRW Company",
            "POSITION": "Part Time - Web Developer",
            "DATE": "September 2016 - May 2017",
            "DESCRIPTION": "As part-time employee, my main tasks were to mentor new interns in our team in their assigned projects. It was a great experience to enhance my leadership skills."
        },
        {
            "COMPANY": "Vigilant, A DRW Company",
            "POSITION": "Internship - Web Developer",
            "DATE": "May 2016 - August 2016",
            "DESCRIPTION": "I developped responsive and real-time web applications with Angular, React, Node.js and Web Sockets for post trade analysis and gained experience on how to build an application from the ground up. Enhanced my knowledge of Node.js, Angular and SQL and ASP framework."
        },
        {
            "COMPANY": "CAE Inc.",
            "POSITION": "Part Time - Quality Assurance",
            "DATE": "September 2015 - May 2016",
            "DESCRIPTION": "My primary tasks during this period were to test services and provide support on various products and inquiries from end-users. It was a great experience dealing with various users and planning requirements."
        },
        {
            "COMPANY": "CAE Inc.",
            "POSITION": "Internship - Quality Assurance",
            "DATE": "May 2015 - August 2015",
            "DESCRIPTION": "My main tasks consisted of developing an ASP.Net Web Form apps for QA metrics. Developped C# and Javascript skills. Testing was also a great part of my day-to-day doing unit tests for backend services and UI testing with Selenium. Gained a great understanding of how important tests are in a software solution."
        },
        {
            "COMPANY": "Hydro-Quebec Research Institute",
            "POSITION": "Internship - Web Developer",
            "DATE": "September 2014 - December 2014",
            "DESCRIPTION": "I got an introduction to REST and the various API interactions. Internship consisted mostly in SharePoint 2013 development of an Intranet using pure Javascript and jQuery."
        }
    ],
    "ABOUT": "Highly motivated Software Engineer graduated from Concordia University in 2017 and a Javascript enthousiast. Always seeking for learning opportunities and new challenges. Passionate about technologies and how to integrate them in a real-world example. I have experience in all the application life cycle from eliciting requirements and planning to testing.\n\nExperienced web developer using a multitude of tools and frameworks such as Angular, React, Node.js, Python, Docker and Ansible. Webpack is usually my go to, when dealing with code bundling and transpiling. Test Driven Development is an approach I try to conform to.\n\nDon't hesitate to reach out to me!"
}
