{
    "TITLE": "Ingénieur Logiciel | Développeur Web",
    "TYPEWRITER": [
        "Salut! Moi c'est Jonathan",
        "Je suis un développeur web",
        "Je suis ingénieur",
        "Je suis ingénieur Logiciel",
        "Voici mon Curriculum Vitae"],
    "SECTIONS": {
        "ABOUT": "À Propos",
        "EDUCATION": "Éducation",
        "SKILLS": "Compétences",
        "VOLUNTEERING": "Bénévolat",
        "WORK": "Expérience"
    },
    "VIEW_MORE": "Voir Plus",
    "VIEW_LESS": "Voir Moins",
    "EDUCATION": {
        "CONCORDIA": {
            "SCHOOL": "Université Concordia (2012-2017)",
            "DESC": "Co-op Baccalauréat Génie Locigiel. Gradué avec distinction. Cote Z cumulative de 3.78.",
            "HONOR": "Honeurs",
            "HONORS": "<ul class='list compact'><li>Bourse d'étude Stan Heaps - 2017</li><li>Liste du recteur - 2017</li><li>Liste du recteur - 2016</li><li>Société Honorifique Golden Key - 2015</li></ul>"
        },
        "CEM": {
            "SCHOOL": "Collège Édouard-Montpetit (2010-2012)",
            "DESC": "Diplôme d'Études Collégiales en Sciences Pures et Appliquées."
        }
    },
    "SKILLS": {
        "SOFT": "Personnelles",
        "HARD": "Techniques",
        "LEADERSHIP": "Leadership",
        "WORK ETHIC": "Éthique de travail",
        "POSITIVE ATTITUDE": "Attitude positive",
        "COMMUNICATION": "Communication",
        "TIME MANAGEMENT": "Gestion du temps",
        "PROBLEM-SOLVING SKILLS": "Résolution de problème",
        "TEAM PLAYER": "Joueur d'équipe",
        "CONFIDENCE": "Confiance",
        "LEARN FROM CRITICISM": "Apprendre par la critique",
        "WORK UNDER PRESSURE": "Travailler sous pression",
        "ADAPTABILITY": "Adaptation"
    },
    "WORK": [
        {
            "COMPANY": "Vigilant, A DRW Company",
            "POSITION": "Ingénieur Logiciel",
            "DATE": "Mai 2017 - Aujourd'hui",
            "DESCRIPTION": "Le développement web, c'est ma tasse de thé. J'adore aller éliciter des requis et en développer une application répondant aux besoins des utilisateurs avec style et précision. Angular, React, Python et Ansible sont mes principaux languages et outils utilisés."
        },
        {
            "COMPANY": "Vigilant, A DRW Company",
            "POSITION": "Temps partiel - Développeur Web",
            "DATE": "Septembre 2016 - Mai 2017",
            "DESCRIPTION": "Étant temps partiel, mon premier mandat était d'être mentor de stagiaires dans notre équipe. Leurs projets variaient beaucoup, utilisant diverses technologies. Mon côté adaptatif et autodidacte a grandement bénéficié à l'équipe."
        },
        {
            "COMPANY": "Vigilant, A DRW Company",
            "POSITION": "Stagiaire - Développeur Web",
            "DATE": "Mai 2016 - Août 2016",
            "DESCRIPTION": "J'ai développé des applications web adaptative et live en utilisant Angular, React, Node.js, et des Web Sockets pour des outils d'analyses post-trade. J'ai également développé mes compétences pour créer de nouvelles applications du départ. Acquis grandement de compétences de Node.js, Angular, SQL et les frameworks ASP. J'ai également développé plusieurs Web Crawlers durant cette période en utilisant plusieurs approches différences (manipulation DOM et regex)."
        },
        {
            "COMPANY": "CAE Inc.",
            "POSITION": "Temps partiel - Assurance Qualité",
            "DATE": "Septembre 2015 - Mai 2016",
            "DESCRIPTION": "Durant cette période transitoire à temps partiel, j'étais principalement attitré a faire du suivi avec les utilisateurs sur nos produits et d'apporter de nouvelles fonctionalités. Le testing étaient également dans mes tâches au quotidien. Ce fut une belle expérience pour agrémenter mes compétences en gestion et planifications de requis."
        },
        {
            "COMPANY": "CAE Inc.",
            "POSITION": "Stagiaire - Assurance Qualité",
            "DATE": "May 2015 - August 2015",
            "DESCRIPTION": "Lors de mon second stage, je développait, modifiait et stylisait un interface web dans l'équipe de QA. J'ai également perfectionné le côté testing, spécifiquement le unit testing et le UI testing avec Selenium. Phase primordiale afin de comprendre comment bien créer du code modulable et maintenable."
        },
        {
            "COMPANY": "Institut de Recherche d'Hydro-Québec",
            "POSITION": "Stagiaire - Développeur Web",
            "DATE": "Septembre 2014 - Décembre 2014",
            "DESCRIPTION": "Mon premier stage m'a permis de développer des connaissances autour des API, plus spécifiquement REST. J'utilisait principalement Microsoft SharePoint 2013 ainsi que du pure Javascript et jQuery."
        }
    ],
    "VOLUNTEERING": {
        "DIABLOS": {
            "HEADER": "Entraîneur des Quarts-Arrières (2015 & 2018)",
            "DESC": "Entraîneur des Quarts-Arrières au sein de l'équipe Bantam AAA des Diablos de La Prairie. S'assurer que les jeunes se développent une organisation rigide afin de concilier étude et sport de compétition. S'assurer que les jeunes pratiquent le sport de façon sécuritaire afin d'éviter les blessures."
        },
        "HABITAT": {
            "HEADER": "Habitat Pour l'Humanité (2017)",
            "DESC": "'Notre mission est de mobiliser des bénévoles et des communautés afin de bâtir des demeures abordables et de promouvoir l’achat d’un logement comme moyen de mettre fin au cycle de la pauvreté.'"
        },
        "MISSION": {
            "HEADER": "Mission Bon Accueil (2017)",
            "DESC":"Fondée en 1892, Mission Bon Accueil est aujourd’hui la plus grande porte d’entrée pour venir en aide aux Montréalais les plus démunis. Une multitude de programmes sont offerts afin d’appuyer les itinérants, les jeunes filles-mères, les familles et les jeunes à risque. Nous redonnons l’espoir par des actions concrètes et des solutions efficaces."
        }
    },
    "ABOUT": "Ingénieur Logiciel gradué de l’Université Concordia en 2017 et enthousiasmé par Javascript. Toujours à l’affut afin d’obtenir des opportunités d’apprentissages et de nouveaux défis. Passionné de nouvelles technologies et de leurs intégrations dans la vie de tous les jours. Beaucoup d’expérience dans le cycle de développement d’une application. Soit de l’obtention des prérequis et planification jusqu’au déploiement et tests.\n\nDéveloppeur web accompli ayant de l'expériences avec plusieurs outils et frameworks dont Angular, React, Node.js, Python, Docket ainsi qu'Ansible. Webpack est mon outil de prédilection pour créer un environnement de production minimaliste et optimisé. L’approche Test Driven Development est une approche dont j’essaie de me conformer le plus possible.\n\nN'hésitez pas à me joindre!"
}
