{
    "TYPEWRITER": [
        "Salut! Moi c'est Jonathan",
        "Je suis un développeur web",
        "Je suis ingénieur",
        "Je suis ingénieur Logiciel",
        "Voici mon Curriculum Vitae"],
    "SECTIONS": {
        "ABOUT": "À Propos",
        "EDUCATION": "Éducation",
        "SKILLS": "Compétences",
        "VOLUNTEERING": "Bénévolat",
        "WORK": "Expérience"
    },
    "VIEW_MORE": "Voir Plus",
    "VIEW_LESS": "Voir Moins",
    "EDUCATION": {
        "CONCORDIA": {
            "SCHOOL": "Université Concordia (2012-2017)",
            "DESC": "Co-op Baccalauréat Génie Locigiel. Gradué avec distinction. Cote Z cumulative de 3.78.",
            "HONOR": "Honeurs",
            "HONORS": "<ul class='list compact'><li>Bourse d'étude Stan Heaps - 2017</li><li>Liste du recteur - 2017</li><li>Liste du recteur - 2016</li><li>Société Honorifique Golden Key - 2015</li></ul>"
        },
        "CEM": {
            "SCHOOL": "Collège Édouard-Montpetit (2010-2012)",
            "DESC": "Diplôme d'Études Collégiales en Sciences Pures et Appliquées."
        }
    },
    "SKILLS": {
        "SOFT": "Personnelles",
        "HARD": "Techniques",
        "LEADERSHIP": "Leadership",
        "WORK ETHIC": "Éthique de travail",
        "POSITIVE ATTITUDE": "Attitude positive",
        "COMMUNICATION": "Communication",
        "TIME MANAGEMENT": "Gestion du temps",
        "PROBLEM-SOLVING SKILLS": "Résolution de problème",
        "TEAM PLAYER": "Joueur d'équipe",
        "CONFIDENCE": "Confiance",
        "LEARN FROM CRITICISM": "Apprendre par la critique",
        "WORK UNDER PRESSURE": "Travailler sous pression",
        "ADAPTABILITY": "Adaptation"
    },
    "WORK": [
        {
            "COMPANY": "Vigilant, A DRW Company",
            "POSITION": "Ingénieur Logiciel",
            "DATE": "Mai 2017 - Aujourd'hui",
            "DESCRIPTION": "Après ma graduation, je suis devenu employé à temps plein chez Vigilant, A DRW Company dans laquelle j'ai acquéri beaucoup de connaissances sur les environnements Linux et l'outil d'automation Ansible ainsi que Capistrano. Mon domaine de travail se situe plus dans le développement web. De plus, j'adore faire des recherches afin de toujours rapporter les nouvelles technologies du web auprès de mon équipe."
        },
        {
            "COMPANY": "Vigilant, A DRW Company",
            "POSITION": "Temps partiel - Développeur Web",
            "DATE": "Septembre 2016 - Mai 2017",
            "DESCRIPTION": "Je me suis fait demandé de rester temps partiel jusqu'à ma graduation à la fin de mon stage chez Vigilant. Mon focus principal durant cette période était d'être le mentor de stagiaires dans mon équipe. Les stagiaires travaillaient principalement en développement Web utilisant Angular et React comme framework front-end ainsi que Node.js, ASP.NET Core & MVC comme serveur. Le mentorat m'a permi d'acquérir beaucoup de leadership à travers cette dernière année d'université."
        },
        {
            "COMPANY": "Vigilant, A DRW Company",
            "POSITION": "Stagiaire - Développeur Web",
            "DATE": "Mai 2016 - Août 2016",
            "DESCRIPTION": "Mon troisième stage Coop fut chez Vigilant, A DRW Company. À cette compagnie, j'ai accentué mes connaissances du web en travaillant sur des application à partir de zéro et sur la maintenance d'applications ayant plus de vécu. J'ai eu l'opportunité de perfectionner mes connaissances en Node.js, AngularJs, Angular et SQL. J'ai également travailler à faire des bot Web."
        },
        {
            "COMPANY": "CAE Inc.",
            "POSITION": "Temps partiel - Assurance Qualité",
            "DATE": "Septembre 2015 - Mai 2016",
            "DESCRIPTION": "Avant de retourner à l'université, on m'a demandé de demeurer temps partiel chez CAE Inc. Mes tâches principales durant cette période étaient de maintenir, développer et retravailler un Dashboard de métriques. Ce fut pour moi une belle expérience pour développer mon côté Expérience Utilisateur et de design web."
        },
        {
            "COMPANY": "CAE Inc.",
            "POSITION": "Stagiaire - Assurance Qualité",
            "DATE": "May 2015 - August 2015",
            "DESCRIPTION": "Mon deuxième stage Coop fut chez CAE Inc., un leader mondial en formation pour pilote en aviation civile. J'ai eu l'opportunité de perfectionner le côté testing des software, un côté que je ne pratiquait pas beaucoup auparavant. Puisque cela était mon focus principal, j'ai appris à créer un code réutilisable et bien organisé. J'ai acquéri de l'expérience en 'design pattern' et architecture de logiciel. La diversification des tâches dans notre domaine est primordiale."
        },
        {
            "COMPANY": "Institut de Recherche d'Hydro-Québec",
            "POSITION": "Stagiaire - Développeur Web",
            "DATE": "Septembre 2014 - Décembre 2014",
            "DESCRIPTION": "Mon premier stage Coop était à l'Institut de Recherche d'Hydro-Québec. En tant que stagiaire de première année, j'avais beaucoup à apprendre. J'ai appris énormément sur les API REST et sur la maintenance d'Intranets utilisant Microsoft SharePoint. Ce fut une très belle première expérience professionnelle dans laquelle j'en suis ressorti grandi."
        }
    ],
    "VOLUNTEERING": {
        "DIABLOS": {
            "HEADER": "Entraîneur des Quarts-Arrières (2015 & 2018)",
            "DESC": "Entraîneur des Quarts-Arrières au sein de l'équipe Bantam AAA des Diablos de La Prairie. S'assurer que les jeunes se développent une organisation rigide afin de concilier étude et sport de compétition. S'assurer que les jeunes pratiquent le sport de façon sécuritaire afin d'éviter les blessures."
        },
        "HABITAT": {
            "HEADER": "Habitat Pour l'Humanité (2017)",
            "DESC": "'Notre mission est de mobiliser des bénévoles et des communautés afin de bâtir des demeures abordables et de promouvoir l’achat d’un logement comme moyen de mettre fin au cycle de la pauvreté.'"
        },
        "MISSION": {
            "HEADER": "Mission Bon Accueil (2017)",
            "DESC":"Fondée en 1892, Mission Bon Accueil est aujourd’hui la plus grande porte d’entrée pour venir en aide aux Montréalais les plus démunis. Une multitude de programmes sont offerts afin d’appuyer les itinérants, les jeunes filles-mères, les familles et les jeunes à risque. Nous redonnons l’espoir par des actions concrètes et des solutions efficaces."
        }
    },
    "ABOUT": "Ingénieur Logiciel gradué de l’Université Concordia en 2017 ayant une grande motivation. Toujours à l’affut afin d’obtenir des opportunités d’apprentissages et de nouveaux défis. Passionné de nouvelles technologies et de leurs intégrations dans la vie de tous les jours. Beaucoup d’expérience dans le cycle de développement d’une application. Soit de l’obtention des prérequis et planification jusqu’au déploiement et tests.\n\nUtilisation intensive d’Ansible et de Capistrano lors du déploiement d’applications et de la maintenance d’environments. Également, je dispose de plusieurs années d’expériences en développement utilisant l’approche MEAN (Mongo, Express, Angular, NodeJs). Webpack est mon outil de prédilection pour créer un environnement de production minimaliste et optimisé. L’approche Test Driven Development est une approche dont j’essaie de me conformer le plus possible."
}
